In [2]:
import pandas as pd

In [3]:
sr=pd.Series(['vaibhav','arjun','roshan','kishan'])
print(sr)

0    vaibhav
1      arjun
2     roshan
3     kishan
dtype: object

In [6]:
sr1=pd.Series(['a','b','d','e'], index=[10,20,30,40])

In [11]:
studentdata={
        "name":['vaibhav','roshan','tushar','kishan','roshan','omkar','ram'],
        'age':[20,30,20,32,21,22,31],
        'city':['pune','nagar','nashik','nagpur','kashmir','pune','mumbai'],
        'marks':[99,89,86,83,84,78,86]

}
sd=pd.DataFrame(studentdata)
sd

      name  age     city  marks
0  vaibhav   20     pune     99
1   roshan   30    nagar     89
2   tushar   20   nashik     86
3   kishan   32   nagpur     83
4   roshan   21  kashmir     84
5    omkar   22     pune     78
6      ram   31   mumbai     86

In [12]:
#access element from DataFrame
print(sd['city'])

0       pune
1      nagar
2     nashik
3     nagpur
4    kashmir
5       pune
6     mumbai
Name: city, dtype: object

In [14]:
print(sd[['city','name']])

      city     name
0     pune  vaibhav
1    nagar   roshan
2   nashik   tushar
3   nagpur   kishan
4  kashmir   roshan
5     pune    omkar
6   mumbai      ram

In [17]:
print(sd[sd['marks']>90])

      name  age  city  marks
0  vaibhav   20  pune     99

In [18]:
print(sd[sd['city']=='pune'])

      name  age  city  marks
0  vaibhav   20  pune     99
5    omkar   22  pune     78

In [19]:
print(sd[(sd['age']>30)&(sd['marks']>80)])

     name  age    city  marks
3  kishan   32  nagpur     83
6     ram   31  mumbai     86

In [22]:
sd['fees']=sd['marks']*5000
sd

      name  age     city  marks    fees
0  vaibhav   20     pune     99  495000
1   roshan   30    nagar     89  445000
2   tushar   20   nashik     86  430000
3   kishan   32   nagpur     83  415000
4   roshan   21  kashmir     84  420000
5    omkar   22     pune     78  390000
6      ram   31   mumbai     86  430000

In [23]:
sd.head()

      name  age     city  marks    fees
0  vaibhav   20     pune     99  495000
1   roshan   30    nagar     89  445000
2   tushar   20   nashik     86  430000
3   kishan   32   nagpur     83  415000
4   roshan   21  kashmir     84  420000

In [24]:
sd.tail()

     name  age     city  marks    fees
2  tushar   20   nashik     86  430000
3  kishan   32   nagpur     83  415000
4  roshan   21  kashmir     84  420000
5   omkar   22     pune     78  390000
6     ram   31   mumbai     86  430000

In [25]:
sd.describe()

             age      marks           fees
count   7.000000   7.000000       7.000000
mean   25.142857  86.428571  432142.857143
std     5.550633   6.502747   32513.733362
min    20.000000  78.000000  390000.000000
25%    20.500000  83.500000  417500.000000
50%    22.000000  86.000000  430000.000000
75%    30.500000  87.500000  437500.000000
max    32.000000  99.000000  495000.000000

In [26]:
sd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   city    7 non-null      object
 3   marks   7 non-null      int64
 4   fees    7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 412.0+ bytes